## Project Outline
- timeline: present to peers on Tuesday
- Day 1: acquire data: CSVs from NPS for Great Smokey Mountains, Zion, Yellowstone, Grand Canyon, Rocky Mountain

In [44]:
# considering the error and the time constraint, let's download the CSV directly and then create the data frame from the CSV
import pandas as pd
import numpy as np
import requests
import wrangle
import os

In [2]:
zion_url = 'https://irma.nps.gov/STATS/SSRSReports/Park%20Specific%20Reports/Recreation%20Visitors%20By%20Month%20(1979%20-%20Last%20Calendar%20Year)?Park=ZION'
grand_canyon_url = 'https://irma.nps.gov/STATS/SSRSReports/Park%20Specific%20Reports/Recreation%20Visitors%20By%20Month%20(1979%20-%20Last%20Calendar%20Year)?Park=GRCA'
great_smokey_mtns_url = 'https://irma.nps.gov/STATS/SSRSReports/Park%20Specific%20Reports/Recreation%20Visitors%20By%20Month%20(1979%20-%20Last%20Calendar%20Year)?Park=GRSM'
yellowstone_url = 'https://irma.nps.gov/STATS/SSRSReports/Park%20Specific%20Reports/Recreation%20Visitors%20By%20Month%20(1979%20-%20Last%20Calendar%20Year)?Park=YELL'
rocky_mtn_url = 'https://irma.nps.gov/STATS/SSRSReports/Park%20Specific%20Reports/Recreation%20Visitors%20By%20Month%20(1979%20-%20Last%20Calendar%20Year)?Park=ROMO'

### Acquire CSVs for top 5 most visited national parks

In [3]:
# 1. Grand Canyon NP
# download the GC visitors data from the NPS at the following URL:
# grand_canyon_url = 'https://irma.nps.gov/STATS/SSRSReports/Park%20Specific%20Reports/Recreation%20Visitors%20By%20Month%20(1979%20-%20Last%20Calendar%20Year)?Park=GRCA'

def get_gc_visitors(use_cache=True):
        filename = "gc_visitors.csv"
        if os.path.isfile(filename) and use_cache:
            return pd.read_csv(filename, header=2)
        else:
            print(""" Download the Grand Canyon visitors dataset at the following URL:
            https://irma.nps.gov/STATS/SSRSReports/Park%20Specific%20Reports/Recreation%20Visitors%20By%20Month%20(1979%20-%20Last%20Calendar%20Year)?Park=GRCA
            """)

# 2. Great Smoky Mountains NP
# download the GSM visitors data from the NPS at the following URL:
# great_smokey_mtns_url = 'https://irma.nps.gov/STATS/SSRSReports/Park%20Specific%20Reports/Recreation%20Visitors%20By%20Month%20(1979%20-%20Last%20Calendar%20Year)?Park=GRSM'

def get_gsm_visitors(use_cache=True):
        filename = "gsm_visitors.csv"
        if os.path.isfile(filename) and use_cache:
            return pd.read_csv(filename, header=2)
        else:
            print(""" Download the Grand Canyon visitors dataset at the following URL:
            https://irma.nps.gov/STATS/SSRSReports/Park%20Specific%20Reports/Recreation%20Visitors%20By%20Month%20(1979%20-%20Last%20Calendar%20Year)?Park=GRSM
            """)

# 3. Zion NP
# download the Zion visitors data from the NPS at the following URL:
# great_smokey_mtns_url = 'https://irma.nps.gov/STATS/SSRSReports/Park%20Specific%20Reports/Recreation%20Visitors%20By%20Month%20(1979%20-%20Last%20Calendar%20Year)?Park=ZION'

def get_zion_visitors(use_cache=True):
        filename = "zion_visitors.csv"
        if os.path.isfile(filename) and use_cache:
            return pd.read_csv(filename, header=2)
        else:
            print(""" Download the Grand Canyon visitors dataset at the following URL:
            https://irma.nps.gov/STATS/SSRSReports/Park%20Specific%20Reports/Recreation%20Visitors%20By%20Month%20(1979%20-%20Last%20Calendar%20Year)?Park=ZION
            """)

# 4. Yellowstone NP
# download the Zion visitors data from the NPS at the following URL:
# great_smokey_mtns_url = 'https://irma.nps.gov/STATS/SSRSReports/Park%20Specific%20Reports/Recreation%20Visitors%20By%20Month%20(1979%20-%20Last%20Calendar%20Year)?Park=YELL'

def get_yellowstone_visitors(use_cache=True):
        filename = "yellowstone_visitors.csv"
        if os.path.isfile(filename) and use_cache:
            return pd.read_csv(filename, header=2)
        else:
            print(""" Download the Grand Canyon visitors dataset at the following URL:
            https://irma.nps.gov/STATS/SSRSReports/Park%20Specific%20Reports/Recreation%20Visitors%20By%20Month%20(1979%20-%20Last%20Calendar%20Year)?Park=YELL
            """)

# 5. Rocky Mountain NP
# download the Zion visitors data from the NPS at the following URL:
# great_smokey_mtns_url = 'https://irma.nps.gov/STATS/SSRSReports/Park%20Specific%20Reports/Recreation%20Visitors%20By%20Month%20(1979%20-%20Last%20Calendar%20Year)?Park=ROMO'

def get_rocky_mtn_visitors(use_cache=True):
        filename = "rocky_mtn_visitors.csv"
        if os.path.isfile(filename) and use_cache:
            return pd.read_csv(filename, header=2)
        else:
            print(""" Download the Grand Canyon visitors dataset at the following URL:
            https://irma.nps.gov/STATS/SSRSReports/Park%20Specific%20Reports/Recreation%20Visitors%20By%20Month%20(1979%20-%20Last%20Calendar%20Year)?Park=ROMO
            """)

In [4]:
# return pd.read_csv(filename, on_bad_lines='skip')
grand_canyon_df = get_gc_visitors()
grand_canyon_df.head()

,Year,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,Textbox5
0,2022,"179,101","191,984","392,273","438,576","496,238",NaN,NaN,NaN,NaN,NaN,NaN,NaN,"1,698,172"
1,2021,"164,922","161,428","317,054","421,232","484,442","538,530","556,766","430,684","399,321","430,734","346,971","280,593","4,532,677"
2,2020,"246,460","252,897","276,002",0,"43,397","232,267","350,003","303,900","249,010","421,568","275,764","245,830","2,897,098"
3,2019,"225,056","213,050","451,228","562,265","618,598","643,821","756,860","700,896","578,852","551,558","347,847","324,380","5,974,411"
4,2018,"257,366","265,949","503,284","549,416","637,703","673,474","799,765","744,826","615,783","555,094","408,794","369,041","6,380,495"

In [5]:
great_smoky_mtn_df = get_gsm_visitors()
great_smoky_mtn_df.head()

,Year,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,Textbox5
0,2022,"409,267","536,592","878,917","1,014,878","1,227,558",NaN,NaN,NaN,NaN,NaN,NaN,NaN,"4,067,212"
1,2021,"525,801","502,459","931,060","1,169,469","1,363,183","1,539,247","1,730,987","1,398,161","1,355,599","1,633,547","1,155,227","856,808","14,161,548"
2,2020,"438,509","426,839","487,535","99,371","828,792","1,535,660","1,726,187","1,544,254","1,400,171","1,739,720","1,091,098","777,584","12,095,720"
3,2019,"496,743","421,770","786,305","999,259","1,096,056","1,469,857","1,613,133","1,411,231","1,273,326","1,408,013","851,419","720,631","12,547,743"
4,2018,"320,864","399,156","689,235","820,657","985,145","1,401,741","1,468,273","1,195,360","1,369,637","1,263,665","867,110","640,357","11,421,200"

In [6]:
zion_df = get_zion_visitors()
zion_df.head()

,Year,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,Textbox5
0,2022,"139,827","168,499","446,308","491,625","539,172",NaN,NaN,NaN,NaN,NaN,NaN,NaN,"1,785,431"
1,2021,"172,747","160,232","429,455","469,775","610,301","675,799","581,496","466,928","483,180","469,379","308,560","211,983","5,039,835"
2,2020,"126,994","133,718","207,400","40,396","178,194","377,425","449,518","450,183","520,987","559,342","319,853","227,244","3,591,254"
3,2019,"98,828","102,269","296,316","372,349","529,553","594,896","629,802","535,322","497,443","429,604","230,180","171,706","4,488,268"
4,2018,"107,960","127,790","373,523","483,487","500,118","541,464","500,350","459,415","481,507","377,826","218,799","147,794","4,320,033"

In [7]:
rocky_mtn_df = get_rocky_mtn_visitors()
rocky_mtn_df.head()

,Year,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,Textbox5
0,2022,"130,331","101,109","145,752","153,666","286,464",NaN,NaN,NaN,NaN,NaN,NaN,NaN,"817,322"
1,2021,"140,715","133,771","155,819","183,792","335,060","671,232","904,767","746,343","521,233","352,736","164,992","124,388","4,434,848"
2,2020,"126,866","110,667","97,690",0,"63,051","491,355","723,478","580,368","500,019","297,665","157,875","156,165","3,305,199"
3,2019,"118,152","99,873","146,414","160,259","280,351","698,224","973,992","830,039","752,320","374,003","123,376","113,050","4,670,053"
4,2018,"111,422","84,245","156,434","151,975","305,993","720,822","931,929","798,306","784,480","312,757","125,349","106,781","4,590,493"

In [8]:
yellowstone_df = get_yellowstone_visitors()
yellowstone_df.head()

,Year,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,Textbox5
0,2022,"45,528","47,300","35,616","79,328","523,680",NaN,NaN,NaN,NaN,NaN,NaN,NaN,"731,452"
1,2021,"35,338","36,897","35,611","67,508","473,799","938,845","1,080,767","921,844","882,078","316,662","33,144","37,749","4,860,242"
2,2020,"25,234","41,880","32,516",0,"46,219","573,205","955,645","881,829","837,114","359,889","24,132","28,643","3,806,306"
3,2019,"33,896","31,650","28,695","48,150","434,385","781,853","936,062","820,006","693,118","171,339","15,628","25,506","4,020,288"
4,2018,"29,179","34,263","22,741","37,766","446,875","810,884","940,563","813,970","724,454","218,076","13,849","22,380","4,115,000"

In [9]:
# check the df's for equal size
yellowstone_df.shape, rocky_mtn_df.shape, zion_df.shape, great_smoky_mtn_df.shape, grand_canyon_df.shape

((44, 14), (44, 14), (44, 14), (44, 14), (44, 14))

In [10]:
# set 'Year' as the index, so that I can stack the dataframe, ie reduce the dimensions so that I can merge the dataframes
yellowstone_df = yellowstone_df.set_index('Year')
yellowstone_df.head()

,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,Textbox5
Year,,,,,,,,,,,,,
2022,"45,528","47,300","35,616","79,328","523,680",NaN,NaN,NaN,NaN,NaN,NaN,NaN,"731,452"
2021,"35,338","36,897","35,611","67,508","473,799","938,845","1,080,767","921,844","882,078","316,662","33,144","37,749","4,860,242"
2020,"25,234","41,880","32,516",0,"46,219","573,205","955,645","881,829","837,114","359,889","24,132","28,643","3,806,306"
2019,"33,896","31,650","28,695","48,150","434,385","781,853","936,062","820,006","693,118","171,339","15,628","25,506","4,020,288"
2018,"29,179","34,263","22,741","37,766","446,875","810,884","940,563","813,970","724,454","218,076","13,849","22,380","4,115,000"

In [11]:
yellowstone_df = yellowstone_df.drop(columns=['Textbox5'])
yellowstone_df.head()

,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC
Year,,,,,,,,,,,,
2022,"45,528","47,300","35,616","79,328","523,680",NaN,NaN,NaN,NaN,NaN,NaN,NaN
2021,"35,338","36,897","35,611","67,508","473,799","938,845","1,080,767","921,844","882,078","316,662","33,144","37,749"
2020,"25,234","41,880","32,516",0,"46,219","573,205","955,645","881,829","837,114","359,889","24,132","28,643"
2019,"33,896","31,650","28,695","48,150","434,385","781,853","936,062","820,006","693,118","171,339","15,628","25,506"
2018,"29,179","34,263","22,741","37,766","446,875","810,884","940,563","813,970","724,454","218,076","13,849","22,380"

In [12]:
# now I'm going to stack, meaning move the columns headers under the index, to reduce the dimensionality of the dataframe
# this will produce a series when I'm done, and it will need to be converted back into a DF
stacked_yellowstone_df = yellowstone_df.stack(level=0)

In [13]:
stacked_yellowstone_df.head(20)

Year
2022  JAN       45,528
      FEB       47,300
      MAR       35,616
      APR       79,328
      MAY      523,680
2021  JAN       35,338
      FEB       36,897
      MAR       35,611
      APR       67,508
      MAY      473,799
      JUN      938,845
      JUL    1,080,767
      AUG      921,844
      SEP      882,078
      OCT      316,662
      NOV       33,144
      DEC       37,749
2020  JAN       25,234
      FEB       41,880
      MAR       32,516
dtype: object

In [14]:
stacked_yellowstone_df = stacked_yellowstone_df.to_frame()

In [15]:
stacked_yellowstone_df.head()

                0
Year
2022 JAN   45,528
     FEB   47,300
     MAR   35,616
     APR   79,328
     MAY  523,680

In [16]:
stacked_yellowstone_df.columns

RangeIndex(start=0, stop=1, step=1)

In [17]:
stacked_yellowstone_df = stacked_yellowstone_df.rename(columns={"0":"yellowstone"})
stacked_yellowstone_df.head(20)

                  0
Year
2022 JAN     45,528
     FEB     47,300
     MAR     35,616
     APR     79,328
     MAY    523,680
2021 JAN     35,338
     FEB     36,897
     MAR     35,611
     APR     67,508
     MAY    473,799
     JUN    938,845
     JUL  1,080,767
     AUG    921,844
     SEP    882,078
     OCT    316,662
     NOV     33,144
     DEC     37,749
2020 JAN     25,234
     FEB     41,880
     MAR     32,516

In [18]:
stacked_yellowstone_df.shape

(521, 1)

In [19]:
stacked_yellowstone_df.columns = ['yellowstone']

In [20]:
stacked_yellowstone_df.head()
# pd.reset_index

         yellowstone
Year
2022 JAN      45,528
     FEB      47,300
     MAR      35,616
     APR      79,328
     MAY     523,680

In [21]:
stacked_yellowstone_df = stacked_yellowstone_df.reset_index(drop=False)
stacked_yellowstone_df.head()

   Year level_1 yellowstone
0  2022     JAN      45,528
1  2022     FEB      47,300
2  2022     MAR      35,616
3  2022     APR      79,328
4  2022     MAY     523,680

In [22]:
stacked_yellowstone_df['date'] = stacked_yellowstone_df.Year.astype(str) + "-" + stacked_yellowstone_df.level_1

In [23]:
stacked_yellowstone_df.head()

   Year level_1 yellowstone      date
0  2022     JAN      45,528  2022-JAN
1  2022     FEB      47,300  2022-FEB
2  2022     MAR      35,616  2022-MAR
3  2022     APR      79,328  2022-APR
4  2022     MAY     523,680  2022-MAY

In [24]:
stacked_yellowstone_df.date = pd.to_datetime(stacked_yellowstone_df.date)

In [25]:
stacked_yellowstone_df = stacked_yellowstone_df.set_index('date').sort_index()

In [26]:
stacked_yellowstone_df = stacked_yellowstone_df.drop(columns=['Year', 'level_1'])

In [27]:
stacked_yellowstone_df.head(20)

           yellowstone
date
1979-01-01      23,605
1979-02-01      31,992
1979-03-01      17,813
1979-04-01      34,095
1979-05-01     108,952
1979-06-01     313,924
1979-07-01     493,902
1979-08-01     493,915
1979-09-01     262,786
1979-10-01      76,542
1979-11-01      12,698
1979-12-01      22,684
1980-01-01      24,757
1980-02-01      36,373
1980-03-01      28,112
1980-04-01      32,466
1980-05-01     101,988
1980-06-01     325,211
1980-07-01     557,810
1980-08-01     523,549

In [28]:
stacked_yellowstone_df.shape

(521, 1)

In [29]:
def prepare_yellowstone(use_cache=True):
    """ This function takes in the dataframe from the get_yellowstone_visitors function, drops the totals column (marked as Textbox5)
    and returns a single column with visitor numbers indexed by month."""
    #use local cache from CSV if available
    filename = 'cleaned_yellowstone_visitors.csv'
    if os.path.isfile(filename) and use_cache:
        return pd.read_csv(filename)
    else:
        df = get_yellowstone_visitors()
        # set 'Year' as the index, so that I can stack the dataframe, ie reduce the dimensions so that I can merge the dataframes
        df = df.set_index('Year')
        # drop 'Textbox5' column. This is a yearly total column for the dataset
        df = df.drop(columns=['Textbox5'])
        # now I'm going to stack, meaning move the columns headers under the index, to reduce the dimensionality of the dataframe
        df = df.stack(level=0)
        # stacking produces a series when I'm done, and it will need to be converted back into a DF
        df = df.to_frame()
        # now add a title to the DF's only column
        df.columns = ['yellowstone']
        # reset the index to seperate the current multi-index into distinct year and month columns
        df = df.reset_index(drop=False)
        # create a composite date column
        df['date'] = df.Year.astype(str) + "-" + df.level_1
        # convert the date column to datetime object
        df.date = pd.to_datetime(df.date)
        # set the date as the index and sort index
        df = df.set_index('date').sort_index()
        # drop Year and level_1 columns that are no longer needed
        df = df.drop(columns=['Year', 'level_1'])
        df.to_csv(filename, index=True)
        return df

In [30]:
df = prepare_yellowstone()
df.head(), df.shape

(           yellowstone
 date
 1979-01-01      23,605
 1979-02-01      31,992
 1979-03-01      17,813
 1979-04-01      34,095
 1979-05-01     108,952,
 (521, 1))

In [31]:
def prepare_zion(use_cache=True):
    """ This function takes in the dataframe from the get_zion_visitors function, drops the totals column (marked as Textbox5)
    and returns a single column with visitor numbers indexed by month."""
    #use local cache from CSV if available
    filename = 'cleaned_zion_visitors.csv'
    if os.path.isfile(filename) and use_cache:
        return pd.read_csv(filename)
    else:
        df = get_zion_visitors()
        # set 'Year' as the index, so that I can stack the dataframe, ie reduce the dimensions so that I can merge the dataframes
        df = df.set_index('Year')
        # drop 'Textbox5' column. This is a yearly total column for the dataset
        df = df.drop(columns=['Textbox5'])
        # now I'm going to stack, meaning move the columns headers under the index, to reduce the dimensionality of the dataframe
        df = df.stack(level=0)
        # stacking produces a series when I'm done, and it will need to be converted back into a DF
        df = df.to_frame()
        # now add a title to the DF's only column
        df.columns = ['zion']
        # reset the index to seperate the current multi-index into distinct year and month columns
        df = df.reset_index(drop=False)
        # create a composite date column
        df['date'] = df.Year.astype(str) + "-" + df.level_1
        # convert the date column to datetime object
        df.date = pd.to_datetime(df.date)
        # set the date as the index and sort index
        df = df.set_index('date').sort_index()
        # drop Year and level_1 columns that are no longer needed
        df = df.drop(columns=['Year', 'level_1'])
        df.to_csv(filename, index=True)
        return df

In [32]:
df = prepare_zion()
df.head(), df.shape

(               zion
 date
 1979-01-01    8,994
 1979-02-01   12,106
 1979-03-01   23,079
 1979-04-01   63,306
 1979-05-01  122,964,
 (521, 1))

In [33]:
def prepare_grand_canyon(use_cache=True):
    """ This function takes in the dataframe from the get_gc_visitors function, drops the totals column (marked as Textbox5)
    and returns a single column with visitor numbers indexed by month."""
    #use local cache from CSV if available
    filename = 'cleaned_grand_canyon_visitors.csv'
    if os.path.isfile(filename) and use_cache:
        return pd.read_csv(filename)
    else:
        df = get_gc_visitors()
        # set 'Year' as the index, so that I can stack the dataframe, ie reduce the dimensions so that I can merge the dataframes
        df = df.set_index('Year')
        # drop 'Textbox5' column. This is a yearly total column for the dataset
        df = df.drop(columns=['Textbox5'])
        # now I'm going to stack, meaning move the columns headers under the index, to reduce the dimensionality of the dataframe
        df = df.stack(level=0)
        # stacking produces a series when I'm done, and it will need to be converted back into a DF
        df = df.to_frame()
        # now add a title to the DF's only column
        df.columns = ['grand_canyon']
        # reset the index to seperate the current multi-index into distinct year and month columns
        df = df.reset_index(drop=False)
        # create a composite date column
        df['date'] = df.Year.astype(str) + "-" + df.level_1
        # convert the date column to datetime object
        df.date = pd.to_datetime(df.date)
        # set the date as the index and sort index
        df = df.set_index('date').sort_index()
        # drop Year and level_1 columns that are no longer needed
        df = df.drop(columns=['Year', 'level_1'])
        df.to_csv(filename, index=True)
        return df

In [34]:
df = prepare_grand_canyon()
df.head(), df.shape

(           grand_canyon
 date
 1979-01-01       37,002
 1979-02-01       46,043
 1979-03-01       91,927
 1979-04-01      123,643
 1979-05-01      205,048,
 (521, 1))

In [35]:
def prepare_rocky_mtn(use_cache=True):
    """ This function takes in the dataframe from the get_rocky_mtn_visitors function, drops the totals column (marked as Textbox5)
    and returns a single column with visitor numbers indexed by month."""
    #use local cache from CSV if available
    filename = 'cleaned_rocky_mtn_visitors.csv'
    if os.path.isfile(filename) and use_cache:
        return pd.read_csv(filename)
    else:
        df = get_rocky_mtn_visitors()
        # set 'Year' as the index, so that I can stack the dataframe, ie reduce the dimensions so that I can merge the dataframes
        df = df.set_index('Year')
        # drop 'Textbox5' column. This is a yearly total column for the dataset
        df = df.drop(columns=['Textbox5'])
        # now I'm going to stack, meaning move the columns headers under the index, to reduce the dimensionality of the dataframe
        df = df.stack(level=0)
        # stacking produces a series when I'm done, and it will need to be converted back into a DF
        df = df.to_frame()
        # now add a title to the DF's only column
        df.columns = ['rocky_mtn']
        # reset the index to seperate the current multi-index into distinct year and month columns
        df = df.reset_index(drop=False)
        # create a composite date column
        df['date'] = df.Year.astype(str) + "-" + df.level_1
        # convert the date column to datetime object
        df.date = pd.to_datetime(df.date)
        # set the date as the index and sort index
        df = df.set_index('date').sort_index()
        # drop Year and level_1 columns that are no longer needed
        df = df.drop(columns=['Year', 'level_1'])
        df.to_csv(filename, index=True)
        return df

In [36]:
df = prepare_rocky_mtn()
df.head(), df.shape

(           rocky_mtn
 date
 1979-01-01    53,585
 1979-02-01    85,931
 1979-03-01    75,070
 1979-04-01    66,873
 1979-05-01    79,577,
 (521, 1))

In [37]:
def prepare_great_smoky_mtns(use_cache=True):
    """ This function takes in the dataframe from the get_gsm_visitors function, drops the totals column (marked as Textbox5)
    and returns a single column with visitor numbers indexed by month."""
    #use local cache from CSV if available
    filename = 'cleaned_gsm_visitors.csv'
    if os.path.isfile(filename) and use_cache:
        return pd.read_csv(filename)
    else:
        df = get_gsm_visitors()
        # set 'Year' as the index, so that I can stack the dataframe, ie reduce the dimensions so that I can merge the dataframes
        df = df.set_index('Year')
        # drop 'Textbox5' column. This is a yearly total column for the dataset
        df = df.drop(columns=['Textbox5'])
        # now I'm going to stack, meaning move the columns headers under the index, to reduce the dimensionality of the dataframe
        df = df.stack(level=0)
        # stacking produces a series when I'm done, and it will need to be converted back into a DF
        df = df.to_frame()
        # now add a title to the DF's only column
        df.columns = ['great_smoky_mtns']
        # reset the index to seperate the current multi-index into distinct year and month columns
        df = df.reset_index(drop=False)
        # create a composite date column
        df['date'] = df.Year.astype(str) + "-" + df.level_1
        # convert the date column to datetime object
        df.date = pd.to_datetime(df.date)
        # set the date as the index and sort index
        df = df.set_index('date').sort_index()
        # drop Year and level_1 columns that are no longer needed
        df = df.drop(columns=['Year', 'level_1'])
        df.to_csv(filename, index=True)
        return df

In [38]:
df = prepare_great_smoky_mtns()
df.head(), df.shape

(           great_smoky_mtns
 date
 1979-01-01          130,261
 1979-02-01          160,764
 1979-03-01          309,163
 1979-04-01          650,485
 1979-05-01          666,017,
 (521, 1))

In [39]:
def get_combined_park_visitors(use_cache=True):
    #use local cache from CSV if available
    filename = 'combined_park_visitors.csv'
    if os.path.isfile(filename) and use_cache:
        return pd.read_csv(filename)
    else:
        yellowstone = prepare_yellowstone()
        grand_canyon = prepare_grand_canyon()
        rocky_mtn = prepare_rocky_mtn()
        zion = prepare_zion()
        great_smoky_mtns = prepare_great_smoky_mtns()
        # create combined df by merging df's on the date index
        combined_park_visitors = yellowstone.merge(grand_canyon, left_index=True, right_index=True, copy=True)
        combined_park_visitors = combined_park_visitors.merge(rocky_mtn,left_index=True, right_index=True, copy=True)
        combined_park_visitors = combined_park_visitors.merge(zion,left_index=True, right_index=True, copy=True)
        combined_park_visitors = combined_park_visitors.merge(great_smoky_mtns,left_index=True, right_index=True, copy=True)
        combined_park_visitors.to_csv(filename, index=False)
        return combined_park_visitors

In [40]:
df = get_combined_park_visitors()
df.head()

/opt/homebrew/anaconda3/lib/python3.9/site-packages/pandas/core/frame.py:9190: FutureWarning: Passing 'suffixes' which cause duplicate columns {'date_x'} in the result is deprecated and will raise a MergeError in a future version.
  return merge(

,date_x,yellowstone,date_y,grand_canyon,date_x,rocky_mtn,date_y,zion,date,great_smoky_mtns
0,1979-01-01,"23,605",1979-01-01,"37,002",1979-01-01,"53,585",1979-01-01,"8,994",1979-01-01,"130,261"
1,1979-02-01,"31,992",1979-02-01,"46,043",1979-02-01,"85,931",1979-02-01,"12,106",1979-02-01,"160,764"
2,1979-03-01,"17,813",1979-03-01,"91,927",1979-03-01,"75,070",1979-03-01,"23,079",1979-03-01,"309,163"
3,1979-04-01,"34,095",1979-04-01,"123,643",1979-04-01,"66,873",1979-04-01,"63,306",1979-04-01,"650,485"
4,1979-05-01,"108,952",1979-05-01,"205,048",1979-05-01,"79,577",1979-05-01,"122,964",1979-05-01,"666,017"

In [45]:
df = wrangle.get_combined_park_visitors()
df.head()

,date_x,yellowstone,date_y,grand_canyon,date_x.1,rocky_mtn,date_y.1,zion,date,great_smoky_mtns
0,1979-01-01,"23,605",1979-01-01,"37,002",1979-01-01,"53,585",1979-01-01,"8,994",1979-01-01,"130,261"
1,1979-02-01,"31,992",1979-02-01,"46,043",1979-02-01,"85,931",1979-02-01,"12,106",1979-02-01,"160,764"
2,1979-03-01,"17,813",1979-03-01,"91,927",1979-03-01,"75,070",1979-03-01,"23,079",1979-03-01,"309,163"
3,1979-04-01,"34,095",1979-04-01,"123,643",1979-04-01,"66,873",1979-04-01,"63,306",1979-04-01,"650,485"
4,1979-05-01,"108,952",1979-05-01,"205,048",1979-05-01,"79,577",1979-05-01,"122,964",1979-05-01,"666,017"

In [46]:
df = df.drop(columns=['date_x', 'date_y', 'date_x.1', 'date_y.1'])

In [47]:
df.head()

  yellowstone grand_canyon rocky_mtn     zion        date great_smoky_mtns
0      23,605       37,002    53,585    8,994  1979-01-01          130,261
1      31,992       46,043    85,931   12,106  1979-02-01          160,764
2      17,813       91,927    75,070   23,079  1979-03-01          309,163
3      34,095      123,643    66,873   63,306  1979-04-01          650,485
4     108,952      205,048    79,577  122,964  1979-05-01          666,017

In [48]:
df.date = pd.to_datetime(df.date)

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 521 entries, 0 to 520
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   yellowstone       521 non-null    object
 1   grand_canyon      521 non-null    object
 2   rocky_mtn         521 non-null    object
 3   zion              521 non-null    object
 4   date              521 non-null    datetime64[ns]
 5   great_smoky_mtns  521 non-null    object
dtypes: datetime64[ns](1), object(5)
memory usage: 24.5+ KB

In [52]:
df = df.set_index(df.date).sort_index()

In [53]:
df.head()

,yellowstone,grand_canyon,rocky_mtn,zion,date,great_smoky_mtns
date,,,,,,
1979-01-01,"23,605","37,002","53,585","8,994",1979-01-01,"130,261"
1979-02-01,"31,992","46,043","85,931","12,106",1979-02-01,"160,764"
1979-03-01,"17,813","91,927","75,070","23,079",1979-03-01,"309,163"
1979-04-01,"34,095","123,643","66,873","63,306",1979-04-01,"650,485"
1979-05-01,"108,952","205,048","79,577","122,964",1979-05-01,"666,017"

In [55]:
df = df.drop(columns='date')

In [56]:
df.head()

           yellowstone grand_canyon rocky_mtn     zion great_smoky_mtns
date
1979-01-01      23,605       37,002    53,585    8,994          130,261
1979-02-01      31,992       46,043    85,931   12,106          160,764
1979-03-01      17,813       91,927    75,070   23,079          309,163
1979-04-01      34,095      123,643    66,873   63,306          650,485
1979-05-01     108,952      205,048    79,577  122,964          666,017

In [57]:
df = df.apply(lambda x: x.str.replace(',', ''))

In [58]:
df.head()

           yellowstone grand_canyon rocky_mtn    zion great_smoky_mtns
date
1979-01-01       23605        37002     53585    8994           130261
1979-02-01       31992        46043     85931   12106           160764
1979-03-01       17813        91927     75070   23079           309163
1979-04-01       34095       123643     66873   63306           650485
1979-05-01      108952       205048     79577  122964           666017

In [59]:
df.columns

Index(['yellowstone', 'grand_canyon', 'rocky_mtn', 'zion', 'great_smoky_mtns'], dtype='object')

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 521 entries, 1979-01-01 to 2022-05-01
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   yellowstone       521 non-null    object
 1   grand_canyon      521 non-null    object
 2   rocky_mtn         521 non-null    object
 3   zion              521 non-null    object
 4   great_smoky_mtns  521 non-null    object
dtypes: object(5)
memory usage: 24.4+ KB

In [61]:
#df['yellowstone', 'grand_canyon', 'rocky_mtn', 'zion', 'great_smoky_mtns'].astype('int64')
df.yellowstone = df.yellowstone.astype('int64')
df.grand_canyon = df.grand_canyon.astype('int64')
df.rocky_mtn = df.rocky_mtn.astype('int64')
df.zion = df.zion.astype('int64')
df.great_smoky_mtns = df.great_smoky_mtns.astype('int64')

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 521 entries, 1979-01-01 to 2022-05-01
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   yellowstone       521 non-null    int64
 1   grand_canyon      521 non-null    int64
 2   rocky_mtn         521 non-null    int64
 3   zion              521 non-null    int64
 4   great_smoky_mtns  521 non-null    int64
dtypes: int64(5)
memory usage: 24.4 KB

In [63]:
df.head()

            yellowstone  grand_canyon  rocky_mtn    zion  great_smoky_mtns
date
1979-01-01        23605         37002      53585    8994            130261
1979-02-01        31992         46043      85931   12106            160764
1979-03-01        17813         91927      75070   23079            309163
1979-04-01        34095        123643      66873   63306            650485
1979-05-01       108952        205048      79577  122964            666017

In [ ]:
df.yellowstone.plot()

In [ ]:
import wrangle

In [ ]:
df = wrangle.get_combined_park_visitors()

In [ ]:
df.head()

In [65]:
def cleaned_and_prepped_NPS_visitors():
    df = wrangle.get_combined_park_visitors()
    df = df.drop(columns=['date_x', 'date_y', 'date_x.1', 'date_y.1'])
    df.date = pd.to_datetime(df.date)
    df = df.set_index(df.date).sort_index()
    df = df.drop(columns='date')
    # cleans the commas out of the numerical columns while they are strings. This only works if all the columns are string objects.
    df = df.apply(lambda x: x.str.replace(',', ''))
    #change columns from strings to int64
    df.yellowstone = df.yellowstone.astype('int64')
    df.grand_canyon = df.grand_canyon.astype('int64')
    df.rocky_mtn = df.rocky_mtn.astype('int64')
    df.zion = df.zion.astype('int64')
    df.great_smoky_mtns = df.great_smoky_mtns.astype('int64')
    return df

In [66]:
df = cleaned_and_prepped_NPS_visitors()

In [67]:
df.head()

            yellowstone  grand_canyon  rocky_mtn    zion  great_smoky_mtns
date
1979-01-01        23605         37002      53585    8994            130261
1979-02-01        31992         46043      85931   12106            160764
1979-03-01        17813         91927      75070   23079            309163
1979-04-01        34095        123643      66873   63306            650485
1979-05-01       108952        205048      79577  122964            666017